Revit 2023 API
STLExportOptions.SetTessellationSettings Method (ExportResolution)
 Sets all the tessellation parameters to its predefined values for the given resolution type.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
Since: 2021.1
Syntax
C#
public void SetTessellationSettings(
	ExportResolution resolutionType
)
Visual Basic
Public Sub SetTessellationSettings ( _
	resolutionType As ExportResolution _
)
Visual C++
public:
void SetTessellationSettings(
	ExportResolution resolutionType
)
Parameters
resolutionType
Type: Autodesk.Revit.DB.ExportResolution
 Type of exporting resolution.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
STLExportOptions Class
SetTessellationSettings Overload
Autodesk.Revit.DB Namespace